public/man/man1/xdg-settings.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - xdg-settings.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - xdg-settings.1</h1>
    
<p>.SH &#34;NAME&#34; xdg-settings - get various settings from the desktop
environment</p>
<p>
.SH &#34;SYNOPSIS&#34;</p>
<p>
.HP u</p>
<p>
<strong>xdg-settings</strong> { | <em>get</em> | <em>check</em> | <em>set</em> } { <strong>property</strong> } [
<strong>subproperty</strong> ] [ <strong>value</strong> ]</p>
<p>
.HP u</p>
<p>
<strong>xdg-settings</strong> { | <strong>–help</strong> | <strong>–list</strong> | <strong>–manual</strong> | <strong>–version</strong> }</p>
<p>
.SH &#34;DESCRIPTION&#34;</p>
<p>
.PP xdg-settings gets various settings from the desktop environment. For
instance, desktop environments often provide proxy configuration and
default web browser settings. Using xdg-settings these parameters can be
extracted for use by applications that do not use the desktop
environments libraries (which would use the settings natively).</p>
<p>
.PP xdg-settings is for use inside a desktop session only. It is not
recommended to use xdg-settings as root.</p>
<p>
.SH &#34;OPTIONS&#34;</p>
<p>
.PP <strong>–help</strong></p>
<blockquote>
<p>Show command synopsis.</p>
<p>
.RE</p>
<p>
.PP <strong>–list</strong></p>
<blockquote>
<p>List all properties xdg-settings knows about.</p>
<p>
.RE</p>
<p>
.PP <strong>–manual</strong></p>
<blockquote>
<p>Show this manual page.</p>
<p>
.RE</p>
<p>
.PP <strong>–version</strong></p>
<blockquote>
<p>Show the xdg-utils version information.</p>
<p>
.RE .SH &#34;PROPERTIES&#34;</p>
<p>
.PP When using xdg-settings to get, check or set a desktop setting,
properties and possibly sub-properties are used to specify the setting
to be changed.</p>
<p>
.PP Some properties (such as default-web-browser) fully describe the
setting to be changed. Other properties (such as
default-url-scheme-handler) require more information (in this case the
actual scheme to set the default handler for) which must be provided in
a sub-property.</p>
<p>
.SH &#34;EXIT CODES&#34;</p>
<p>
.PP An exit code of 0 indicates success while a non-zero exit code
indicates failure. The following failure codes can be returned:</p>
<p>
.PP <strong>1</strong></p>
<blockquote>
<p>Error in command line syntax.</p>
<p>
.RE .PP <strong>2</strong></p>
<blockquote>
<p>One of the files passed on the command line did not exist.</p>
<p>
.RE .PP <strong>3</strong></p>
<blockquote>
<p>A required tool could not be found.</p>
<p>
.RE .PP <strong>4</strong></p>
<blockquote>
<p>The action failed.</p>
<p>
.RE .SH &#34;SEE ALSO&#34;</p>
<p>
.PP <strong>xdg-mime*(1), *xdg-open*(1), *MIME applications associations
specification</strong>[1]</p>
<p>
.SH &#34;EXAMPLES&#34;</p>
<p>
.PP Get the desktop file name of the current default web browser</p>
<blockquote>
<pre class="example">
        xdg-settings get default-web-browser
</pre>
</blockquote>
<p>
.PP Check whether the default web browser is firefox.desktop, which can
be false even if &#34;get default-web-browser&#34; says that is the current
value (if only some of the underlying settings actually reflect that
value)</p>
<blockquote>
<pre class="example">
        xdg-settings check default-web-browser firefox.desktop
</pre>
</blockquote>
<p>
.PP Set the default web browser to google-chrome.desktop</p>
<blockquote>
<pre class="example">
        xdg-settings set default-web-browser google-chrome.desktop
</pre>
</blockquote>
<p>
.PP Set the default mailto URL scheme handler to be evolution.desktop</p>
<blockquote>
<pre class="example">
        xdg-settings set default-url-scheme-handler mailto evolution.desktop
</pre>
</blockquote>
</blockquote>
</blockquote>
</blockquote>
</blockquote>
</blockquote>
</blockquote>
</blockquote>
</blockquote>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
AUTHOR
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p><strong>Mike Mammarella</strong></p>
<blockquote>
<p>Author.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
COPYRIGHT
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>\\
Copyright © 2009-2011\\</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
NOTES
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<dl>
<dt>
1.
</dt>
<dd>MIME applications associations specification

http://www.freedesktop.org/wiki/Specifications/mime-apps-spec/</dd>
</dl>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
